app/controllers/microposts_controller.rb

  def destroy
    @micropost.destroy
---
DELETE FROM "microposts" WHERE ("microposts"."id" = 2)