app/controllers/users_controller.rb

  def index
    @title = "All users"
      #To change the number of users per page, add ":per_page => x" to params
    @users = User.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) AS count_id FROM "users"

  def show
    @user = User.find( params[:id] )
    @microposts = @user.microposts.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT "microposts".* FROM "microposts" WHERE ("microposts".user_id = 3) ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM "microposts" WHERE ("microposts".user_id = 3)) AS subquery

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "encrypted_password", "name", "salt", "updated_at") VALUES ('2011-03-02 14:32:32.029851', 'first@example.com', 'c5686fb2c2de84fe33fca1e2fa72b6d9cc51fee0065bd3280718d47d5709aac7', 'First User', 'e44d019f7386ffa9a38c9cd307e4d079f340817ce6370cd2b8340aefbf6efa8a', '2011-03-02 14:32:32.029851')